
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.api_gateway_role.aws_iam_role.apigw_cloudwatch_role will be created
  + resource "aws_iam_role" "apigw_cloudwatch_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "apigateway.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "apigw-cloudwatch-logs-role-prod"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.api_gateway_role.aws_iam_role_policy_attachment.apigw_cloudwatch will be created
  + resource "aws_iam_role_policy_attachment" "apigw_cloudwatch" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonAPIGatewayPushToCloudWatchLogs"
      + role       = "apigw-cloudwatch-logs-role-prod"
    }

  # module.apigw_invoke_lambda_permission.aws_lambda_permission.allow_apigw_invoke_DELETE will be created
  + resource "aws_lambda_permission" "allow_apigw_invoke_DELETE" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "fruit-api-DELETE-prod"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowDELETEExecutionFromAPIGateway"
      + statement_id_prefix = (known after apply)
    }

  # module.apigw_invoke_lambda_permission.aws_lambda_permission.allow_apigw_invoke_GET will be created
  + resource "aws_lambda_permission" "allow_apigw_invoke_GET" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "fruit-api-GET-prod"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowGETExecutionFromAPIGateway"
      + statement_id_prefix = (known after apply)
    }

  # module.apigw_invoke_lambda_permission.aws_lambda_permission.allow_apigw_invoke_GET_ID will be created
  + resource "aws_lambda_permission" "allow_apigw_invoke_GET_ID" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "fruit-api-GET-prod"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowGETIDExecutionFromAPIGateway"
      + statement_id_prefix = (known after apply)
    }

  # module.apigw_invoke_lambda_permission.aws_lambda_permission.allow_apigw_invoke_PATCH will be created
  + resource "aws_lambda_permission" "allow_apigw_invoke_PATCH" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "fruit-api-PATCH-prod"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowPATCHExecutionFromAPIGateway"
      + statement_id_prefix = (known after apply)
    }

  # module.apigw_invoke_lambda_permission.aws_lambda_permission.allow_apigw_invoke_PUT will be created
  + resource "aws_lambda_permission" "allow_apigw_invoke_PUT" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "fruit-api-PUT-prod"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowPUTExecutionFromAPIGateway"
      + statement_id_prefix = (known after apply)
    }

  # module.app_db.aws_appautoscaling_policy.read[0] will be created
  + resource "aws_appautoscaling_policy" "read" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "fruit-api-table-Read-Autoscaling-Policy"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "table/fruit-api-table-prod"
      + scalable_dimension = "dynamodb:table:ReadCapacityUnits"
      + service_namespace  = "dynamodb"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in   = false
          + scale_in_cooldown  = 60
          + scale_out_cooldown = 60
          + target_value       = 70

          + predefined_metric_specification {
              + predefined_metric_type = "DynamoDBReadCapacityUtilization"
            }
        }
    }

  # module.app_db.aws_appautoscaling_policy.write[0] will be created
  + resource "aws_appautoscaling_policy" "write" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "fruit-api-table-WriteAutoScalingPolicy"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "table/fruit-api-table-prod"
      + scalable_dimension = "dynamodb:table:WriteCapacityUnits"
      + service_namespace  = "dynamodb"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in   = false
          + scale_in_cooldown  = 60
          + scale_out_cooldown = 60
          + target_value       = 70

          + predefined_metric_specification {
              + predefined_metric_type = "DynamoDBWriteCapacityUtilization"
            }
        }
    }

  # module.app_db.aws_appautoscaling_target.read[0] will be created
  + resource "aws_appautoscaling_target" "read" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + max_capacity       = 10
      + min_capacity       = 3
      + resource_id        = "table/fruit-api-table-prod"
      + role_arn           = (known after apply)
      + scalable_dimension = "dynamodb:table:ReadCapacityUnits"
      + service_namespace  = "dynamodb"
      + tags_all           = (known after apply)

      + suspended_state (known after apply)
    }

  # module.app_db.aws_appautoscaling_target.write[0] will be created
  + resource "aws_appautoscaling_target" "write" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + max_capacity       = 10
      + min_capacity       = 3
      + resource_id        = "table/fruit-api-table-prod"
      + role_arn           = (known after apply)
      + scalable_dimension = "dynamodb:table:WriteCapacityUnits"
      + service_namespace  = "dynamodb"
      + tags_all           = (known after apply)

      + suspended_state (known after apply)
    }

  # module.app_db.aws_dynamodb_table.table will be created
  + resource "aws_dynamodb_table" "table" {
      + arn                         = (known after apply)
      + billing_mode                = "PROVISIONED"
      + deletion_protection_enabled = true
      + hash_key                    = "id"
      + id                          = (known after apply)
      + name                        = "fruit-api-table-prod"
      + read_capacity               = 1
      + stream_arn                  = (known after apply)
      + stream_label                = (known after apply)
      + stream_view_type            = (known after apply)
      + tags                        = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "Doug"
          + "Project"     = "fruit-api-project"
        }
      + tags_all                    = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "Doug"
          + "Project"     = "fruit-api-project"
        }
      + write_capacity              = 1

      + attribute {
          + name = "id"
          + type = "S"
        }

      + point_in_time_recovery {
          + enabled                 = true
          + recovery_period_in_days = (known after apply)
        }

      + server_side_encryption {
          + enabled     = true
          + kms_key_arn = (known after apply)
        }

      + ttl (known after apply)
    }

  # module.lambda_exec_role.aws_iam_policy.lambda_dynamodb_policy will be created
  + resource "aws_iam_policy" "lambda_dynamodb_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "lambda-dynamodb-policy-prod"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "dynamodb:UpdateItem",
                          + "dynamodb:Scan",
                          + "dynamodb:PutItem",
                          + "dynamodb:GetItem",
                          + "dynamodb:DeleteItem",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:dynamodb:us-east-1:975049995039:table/fruit-api-table-prod"
                    },
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:DescribeLogStreams",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:us-east-1:975049995039:log-group:/aws/lambda/*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.lambda_exec_role.aws_iam_role.lambda_exec_role will be created
  + resource "aws_iam_role" "lambda_exec_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "lambda-execution-role-prod"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.lambda_exec_role.aws_iam_role_policy_attachment.lambda_dynamodb_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "lambda_dynamodb_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "lambda-execution-role-prod"
    }

  # module.lambda_functions["DELETE"].aws_lambda_function.rest_api will be created
  + resource "aws_lambda_function" "rest_api" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "fruit-api-DELETE-prod"
      + handler                        = "handler.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 256
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs22.x"
      + s3_bucket                      = "fruit-api-lambda-code-bucket-prod-a66a20075f"
      + s3_key                         = "fruit-api-DELETE.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "Doug"
          + "Project"     = "fruit-api-project"
        }
      + tags_all                       = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "Doug"
          + "Project"     = "fruit-api-project"
        }
      + timeout                        = 10
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "DYNAMODB_TABLE" = "fruit-api-table-prod"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.lambda_functions["DELETE"].aws_s3_object.lambda_zip will be created
  + resource "aws_s3_object" "lambda_zip" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "fruit-api-lambda-code-bucket-prod-a66a20075f"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "fruit-api-DELETE.zip"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../app/handlers/fruit-api-DELETE.zip"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.lambda_functions["GET"].aws_lambda_function.rest_api will be created
  + resource "aws_lambda_function" "rest_api" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "fruit-api-GET-prod"
      + handler                        = "handler.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 256
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs22.x"
      + s3_bucket                      = "fruit-api-lambda-code-bucket-prod-a66a20075f"
      + s3_key                         = "fruit-api-GET.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "Doug"
          + "Project"     = "fruit-api-project"
        }
      + tags_all                       = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "Doug"
          + "Project"     = "fruit-api-project"
        }
      + timeout                        = 10
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "DYNAMODB_TABLE" = "fruit-api-table-prod"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.lambda_functions["GET"].aws_s3_object.lambda_zip will be created
  + resource "aws_s3_object" "lambda_zip" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "fruit-api-lambda-code-bucket-prod-a66a20075f"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "fruit-api-GET.zip"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../app/handlers/fruit-api-GET.zip"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.lambda_functions["PATCH"].aws_lambda_function.rest_api will be created
  + resource "aws_lambda_function" "rest_api" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "fruit-api-PATCH-prod"
      + handler                        = "handler.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 256
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs22.x"
      + s3_bucket                      = "fruit-api-lambda-code-bucket-prod-a66a20075f"
      + s3_key                         = "fruit-api-PATCH.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "Doug"
          + "Project"     = "fruit-api-project"
        }
      + tags_all                       = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "Doug"
          + "Project"     = "fruit-api-project"
        }
      + timeout                        = 10
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "DYNAMODB_TABLE" = "fruit-api-table-prod"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.lambda_functions["PATCH"].aws_s3_object.lambda_zip will be created
  + resource "aws_s3_object" "lambda_zip" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "fruit-api-lambda-code-bucket-prod-a66a20075f"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "fruit-api-PATCH.zip"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../app/handlers/fruit-api-PATCH.zip"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.lambda_functions["PUT"].aws_lambda_function.rest_api will be created
  + resource "aws_lambda_function" "rest_api" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "fruit-api-PUT-prod"
      + handler                        = "handler.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 256
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs22.x"
      + s3_bucket                      = "fruit-api-lambda-code-bucket-prod-a66a20075f"
      + s3_key                         = "fruit-api-PUT.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "Doug"
          + "Project"     = "fruit-api-project"
        }
      + tags_all                       = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "Doug"
          + "Project"     = "fruit-api-project"
        }
      + timeout                        = 10
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "DYNAMODB_TABLE" = "fruit-api-table-prod"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.lambda_functions["PUT"].aws_s3_object.lambda_zip will be created
  + resource "aws_s3_object" "lambda_zip" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "fruit-api-lambda-code-bucket-prod-a66a20075f"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "fruit-api-PUT.zip"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../app/handlers/fruit-api-PUT.zip"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.observability.aws_api_gateway_account.api_gateway_role will be created
  + resource "aws_api_gateway_account" "api_gateway_role" {
      + api_key_version     = (known after apply)
      + cloudwatch_role_arn = (known after apply)
      + features            = (known after apply)
      + id                  = (known after apply)
      + throttle_settings   = (known after apply)
    }

  # module.observability.aws_api_gateway_method_settings.path_specific will be created
  + resource "aws_api_gateway_method_settings" "path_specific" {
      + id          = (known after apply)
      + method_path = "*/*"
      + rest_api_id = (known after apply)
      + stage_name  = "prod"

      + settings {
          + cache_data_encrypted                       = (known after apply)
          + cache_ttl_in_seconds                       = (known after apply)
          + caching_enabled                            = (known after apply)
          + data_trace_enabled                         = false
          + logging_level                              = "ERROR"
          + metrics_enabled                            = true
          + require_authorization_for_cache_control    = (known after apply)
          + throttling_burst_limit                     = -1
          + throttling_rate_limit                      = -1
          + unauthorized_cache_control_header_strategy = (known after apply)
        }
    }

  # module.observability.aws_api_gateway_stage.api_stage will be created
  + resource "aws_api_gateway_stage" "api_stage" {
      + arn                  = (known after apply)
      + deployment_id        = (known after apply)
      + execution_arn        = (known after apply)
      + id                   = (known after apply)
      + invoke_url           = (known after apply)
      + rest_api_id          = (known after apply)
      + stage_name           = "prod"
      + tags_all             = (known after apply)
      + web_acl_arn          = (known after apply)
      + xray_tracing_enabled = true

      + access_log_settings {
          + destination_arn = (known after apply)
          + format          = jsonencode(
                {
                  + httpMethod   = "$context.httpMethod"
                  + ip           = "$context.identity.sourceIp"
                  + protocol     = "$context.protocol"
                  + requestId    = "$context.requestId"
                  + requestTime  = "$context.requestTime"
                  + resourcePath = "$context.resourcePath"
                  + responseTime = "$context.responseLatency"
                  + status       = "$context.status"
                }
            )
        }
    }

  # module.observability.aws_cloudwatch_dashboard.api_dashboard will be created
  + resource "aws_cloudwatch_dashboard" "api_dashboard" {
      + dashboard_arn  = (known after apply)
      + dashboard_body = (known after apply)
      + dashboard_name = "serverless-api-prod-dashboard"
      + id             = (known after apply)
    }

  # module.observability.aws_cloudwatch_log_group.api_access_logs will be created
  + resource "aws_cloudwatch_log_group" "api_access_logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/apigw/fruits-api-access-logs-prod"
      + name_prefix       = (known after apply)
      + retention_in_days = 14
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "Doug"
          + "Project"     = "fruit-api-project"
        }
      + tags_all          = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "Doug"
          + "Project"     = "fruit-api-project"
        }
    }

  # module.observability.aws_cloudwatch_log_group.api_execution_logs will be created
  + resource "aws_cloudwatch_log_group" "api_execution_logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = (known after apply)
      + name_prefix       = (known after apply)
      + retention_in_days = 14
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "Doug"
          + "Project"     = "fruit-api-project"
        }
      + tags_all          = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "Doug"
          + "Project"     = "fruit-api-project"
        }
    }

  # module.observability.aws_cloudwatch_log_group.lambda_logs["DELETE"] will be created
  + resource "aws_cloudwatch_log_group" "lambda_logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/fruit-api-DELETE-prod"
      + name_prefix       = (known after apply)
      + retention_in_days = 14
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "Doug"
          + "Project"     = "fruit-api-project"
        }
      + tags_all          = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "Doug"
          + "Project"     = "fruit-api-project"
        }
    }

  # module.observability.aws_cloudwatch_log_group.lambda_logs["GET"] will be created
  + resource "aws_cloudwatch_log_group" "lambda_logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/fruit-api-GET-prod"
      + name_prefix       = (known after apply)
      + retention_in_days = 14
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "Doug"
          + "Project"     = "fruit-api-project"
        }
      + tags_all          = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "Doug"
          + "Project"     = "fruit-api-project"
        }
    }

  # module.observability.aws_cloudwatch_log_group.lambda_logs["PATCH"] will be created
  + resource "aws_cloudwatch_log_group" "lambda_logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/fruit-api-PATCH-prod"
      + name_prefix       = (known after apply)
      + retention_in_days = 14
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "Doug"
          + "Project"     = "fruit-api-project"
        }
      + tags_all          = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "Doug"
          + "Project"     = "fruit-api-project"
        }
    }

  # module.observability.aws_cloudwatch_log_group.lambda_logs["PUT"] will be created
  + resource "aws_cloudwatch_log_group" "lambda_logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/fruit-api-PUT-prod"
      + name_prefix       = (known after apply)
      + retention_in_days = 14
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "Doug"
          + "Project"     = "fruit-api-project"
        }
      + tags_all          = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "Doug"
          + "Project"     = "fruit-api-project"
        }
    }

  # module.rest_api.aws_api_gateway_deployment.api_deployment will be created
  + resource "aws_api_gateway_deployment" "api_deployment" {
      + created_date  = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = (known after apply)
    }

  # module.rest_api.aws_api_gateway_integration.api_integration_DELETE will be created
  + resource "aws_api_gateway_integration" "api_integration_DELETE" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "DELETE"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.rest_api.aws_api_gateway_integration.api_integration_GET will be created
  + resource "aws_api_gateway_integration" "api_integration_GET" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.rest_api.aws_api_gateway_integration.api_integration_GET_ID will be created
  + resource "aws_api_gateway_integration" "api_integration_GET_ID" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.rest_api.aws_api_gateway_integration.api_integration_PATCH will be created
  + resource "aws_api_gateway_integration" "api_integration_PATCH" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "PATCH"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.rest_api.aws_api_gateway_integration.api_integration_PUT will be created
  + resource "aws_api_gateway_integration" "api_integration_PUT" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "PUT"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.rest_api.aws_api_gateway_method.api_method_DELETE will be created
  + resource "aws_api_gateway_method" "api_method_DELETE" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "DELETE"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.rest_api.aws_api_gateway_method.api_method_GET will be created
  + resource "aws_api_gateway_method" "api_method_GET" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "GET"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.rest_api.aws_api_gateway_method.api_method_GET_ID will be created
  + resource "aws_api_gateway_method" "api_method_GET_ID" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "GET"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.rest_api.aws_api_gateway_method.api_method_PATCH will be created
  + resource "aws_api_gateway_method" "api_method_PATCH" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "PATCH"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.rest_api.aws_api_gateway_method.api_method_PUT will be created
  + resource "aws_api_gateway_method" "api_method_PUT" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "PUT"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.rest_api.aws_api_gateway_resource.api_resource_fruits will be created
  + resource "aws_api_gateway_resource" "api_resource_fruits" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "fruits"
      + rest_api_id = (known after apply)
    }

  # module.rest_api.aws_api_gateway_resource.api_resource_fruits_id will be created
  + resource "aws_api_gateway_resource" "api_resource_fruits_id" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "{id}"
      + rest_api_id = (known after apply)
    }

  # module.rest_api.aws_api_gateway_rest_api.rest_api will be created
  + resource "aws_api_gateway_rest_api" "rest_api" {
      + api_key_source               = (known after apply)
      + arn                          = (known after apply)
      + binary_media_types           = (known after apply)
      + created_date                 = (known after apply)
      + description                  = "This is my Fruit API for demonstration purposes"
      + disable_execute_api_endpoint = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + minimum_compression_size     = (known after apply)
      + name                         = "Fruit-API-prod"
      + policy                       = (known after apply)
      + root_resource_id             = (known after apply)
      + tags                         = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "Doug"
          + "Project"     = "fruit-api-project"
        }
      + tags_all                     = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "Doug"
          + "Project"     = "fruit-api-project"
        }

      + endpoint_configuration {
          + ip_address_type  = (known after apply)
          + types            = [
              + "REGIONAL",
            ]
          + vpc_endpoint_ids = (known after apply)
        }
    }

Plan: 47 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + app_db_table_name = "fruit-api-table-prod"

<!-- Sticky Pull Request Comment -->